In [3]:
#### Learning

In [84]:
import pandas as pd
import glob

In [135]:
files = [file for file in glob.glob("*.csv")]
all = pd.DataFrame()

In [136]:
for file in files:
    df = pd.read_csv(file)
    all = pd.concat([all, df])

In [137]:
all.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [138]:
### remove NaN rows

In [139]:
all = all.dropna(how = 'all')

In [140]:
### add Month column

In [141]:
all["Month"] = all["Order Date"].str[0:2]

In [142]:
### remove rows where Order Date is invalid

In [143]:
temp = all[all["Order Date"].str[0:2] == 'Or']

In [144]:
temp.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
519,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
1149,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
1155,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
2878,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or
2893,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Or

In [145]:
all = all[all["Order Date"].str[0:2] != 'Or']

In [146]:
#### convert Month to int type

In [147]:
all["Month"] = all["Month"].astype('int32')

In [148]:
### add Total column

In [149]:
all["Total"] = all["Price Each"].astype('float') * all["Quantity Ordered"].astype('int32')

In [150]:
all.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Total
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001",4,23.90
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215",4,99.99
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4,600.00
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001",4,11.99
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001",4,11.99

In [151]:
all = all.sort_values("Total", ascending= False)

In [152]:
all.head(1)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Total
4717,181069,Macbook Pro Laptop,2,1700,04/27/19 21:01,"668 Park St, San Francisco, CA 94016",4,3400.0